Model: "model"
______________________________________________________________________________________________________________________________________________________
Layer (type)                                                       Output Shape                                                Param #                
======================================================================================================================================================
input_1 (InputLayer)                                               [(None, 256, 256, 3)]                                       0                      
______________________________________________________________________________________________________________________________________________________
lambda (Lambda)                                                    (None, 256, 256, 3)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d (Conv2D)                                                    (None, 64, 64, 96)                                          34944                  
______________________________________________________________________________________________________________________________________________________
lambda_1 (Lambda)                                                  (None, 64, 64, 96)                                          0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)                           (None, 64, 64, 96)                                          384                    
______________________________________________________________________________________________________________________________________________________
lambda_2 (Lambda)                                                  (None, 64, 64, 96)                                          0                      
______________________________________________________________________________________________________________________________________________________
activation (Activation)                                            (None, 64, 64, 96)                                          0                      
______________________________________________________________________________________________________________________________________________________
lambda_3 (Lambda)                                                  (None, 64, 64, 96)                                          0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                                       (None, 32, 32, 96)                                          0                      
______________________________________________________________________________________________________________________________________________________
lambda_4 (Lambda)                                                  (None, 32, 32, 96)                                          0                      
______________________________________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                                                  (None, 32, 32, 256)                                         614656                 
______________________________________________________________________________________________________________________________________________________
lambda_5 (Lambda)                                                  (None, 32, 32, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)                         (None, 32, 32, 256)                                         1024                   
______________________________________________________________________________________________________________________________________________________
lambda_6 (Lambda)                                                  (None, 32, 32, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
activation_1 (Activation)                                          (None, 32, 32, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_7 (Lambda)                                                  (None, 32, 32, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)                                     (None, 16, 16, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_8 (Lambda)                                                  (None, 16, 16, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                                                  (None, 16, 16, 384)                                         885120                 
______________________________________________________________________________________________________________________________________________________
lambda_9 (Lambda)                                                  (None, 16, 16, 384)                                         0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)                         (None, 16, 16, 384)                                         1536                   
______________________________________________________________________________________________________________________________________________________
lambda_10 (Lambda)                                                 (None, 16, 16, 384)                                         0                      
______________________________________________________________________________________________________________________________________________________
activation_2 (Activation)                                          (None, 16, 16, 384)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_11 (Lambda)                                                 (None, 16, 16, 384)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                                                  (None, 16, 16, 384)                                         1327488                
______________________________________________________________________________________________________________________________________________________
lambda_12 (Lambda)                                                 (None, 16, 16, 384)                                         0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)                         (None, 16, 16, 384)                                         1536                   
______________________________________________________________________________________________________________________________________________________
lambda_13 (Lambda)                                                 (None, 16, 16, 384)                                         0                      
______________________________________________________________________________________________________________________________________________________
activation_3 (Activation)                                          (None, 16, 16, 384)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_14 (Lambda)                                                 (None, 16, 16, 384)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                                                  (None, 16, 16, 256)                                         884992                 
______________________________________________________________________________________________________________________________________________________
lambda_15 (Lambda)                                                 (None, 16, 16, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)                         (None, 16, 16, 256)                                         1024                   
______________________________________________________________________________________________________________________________________________________
lambda_16 (Lambda)                                                 (None, 16, 16, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
activation_4 (Activation)                                          (None, 16, 16, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_17 (Lambda)                                                 (None, 16, 16, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)                                     (None, 8, 8, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_18 (Lambda)                                                 (None, 8, 8, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
flatten (Flatten)                                                  (None, 16384)                                               0                      
______________________________________________________________________________________________________________________________________________________
lambda_19 (Lambda)                                                 (None, 16384)                                               0                      
______________________________________________________________________________________________________________________________________________________
dense (Dense)                                                      (None, 4096)                                                67112960               
______________________________________________________________________________________________________________________________________________________
lambda_20 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)                         (None, 4096)                                                16384                  
______________________________________________________________________________________________________________________________________________________
lambda_21 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
activation_5 (Activation)                                          (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
lambda_22 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
dropout (Dropout)                                                  (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
lambda_23 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
dense_1 (Dense)                                                    (None, 4096)                                                16781312               
______________________________________________________________________________________________________________________________________________________
lambda_24 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)                         (None, 4096)                                                16384                  
______________________________________________________________________________________________________________________________________________________
lambda_25 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
activation_6 (Activation)                                          (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
lambda_26 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
dropout_1 (Dropout)                                                (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
lambda_27 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
dense_2 (Dense)                                                    (None, 1000)                                                4097000                
______________________________________________________________________________________________________________________________________________________
lambda_28 (Lambda)                                                 (None, 1000)                                                0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)                         (None, 1000)                                                4000                   
______________________________________________________________________________________________________________________________________________________
lambda_29 (Lambda)                                                 (None, 1000)                                                0                      
______________________________________________________________________________________________________________________________________________________
activation_7 (Activation)                                          (None, 1000)                                                0                      
______________________________________________________________________________________________________________________________________________________
lambda_30 (Lambda)                                                 (None, 1000)                                                0                      
______________________________________________________________________________________________________________________________________________________
dropout_2 (Dropout)                                                (None, 1000)                                                0                      
______________________________________________________________________________________________________________________________________________________
lambda_31 (Lambda)                                                 (None, 1000)                                                0                      
______________________________________________________________________________________________________________________________________________________
dense_3 (Dense)                                                    (None, 10)                                                  10010                  
______________________________________________________________________________________________________________________________________________________
lambda_32 (Lambda)                                                 (None, 10)                                                  0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)                         (None, 10)                                                  40                     
______________________________________________________________________________________________________________________________________________________
lambda_33 (Lambda)                                                 (None, 10)                                                  0                      
______________________________________________________________________________________________________________________________________________________
activation_8 (Activation)                                          (None, 10)                                                  0                      
______________________________________________________________________________________________________________________________________________________
lambda_34 (Lambda)                                                 (None, 10)                                                  0                      
======================================================================================================================================================
Total params: 91,790,794
Trainable params: 91,769,638
Non-trainable params: 21,156
______________________________________________________________________________________________________________________________________________________
None
