Model: "model"
______________________________________________________________________________________________________________________________________________________
Layer (type)                                                       Output Shape                                                Param #                
======================================================================================================================================================
input_1 (InputLayer)                                               [(None, 224, 224, 3)]                                       0                      
______________________________________________________________________________________________________________________________________________________
lambda (Lambda)                                                    (None, 224, 224, 3)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d (Conv2D)                                                    (None, 112, 112, 64)                                        1728                   
______________________________________________________________________________________________________________________________________________________
lambda_1 (Lambda)                                                  (None, 112, 112, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                                       (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
lambda_2 (Lambda)                                                  (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                                                  (None, 56, 56, 64)                                          36864                  
______________________________________________________________________________________________________________________________________________________
lambda_3 (Lambda)                                                  (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization (BatchNormalization)                           (None, 56, 56, 64)                                          256                    
______________________________________________________________________________________________________________________________________________________
lambda_4 (Lambda)                                                  (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
re_lu (ReLU)                                                       (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
lambda_5 (Lambda)                                                  (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                                                  (None, 56, 56, 64)                                          36864                  
______________________________________________________________________________________________________________________________________________________
lambda_6 (Lambda)                                                  (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)                         (None, 56, 56, 64)                                          256                    
______________________________________________________________________________________________________________________________________________________
lambda_7 (Lambda)                                                  (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
re_lu_1 (ReLU)                                                     (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
lambda_8 (Lambda)                                                  (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                                                  (None, 56, 56, 64)                                          36864                  
______________________________________________________________________________________________________________________________________________________
lambda_9 (Lambda)                                                  (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)                         (None, 56, 56, 64)                                          256                    
______________________________________________________________________________________________________________________________________________________
lambda_10 (Lambda)                                                 (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
re_lu_2 (ReLU)                                                     (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
lambda_11 (Lambda)                                                 (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                                                  (None, 56, 56, 64)                                          36864                  
______________________________________________________________________________________________________________________________________________________
lambda_12 (Lambda)                                                 (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)                         (None, 56, 56, 64)                                          256                    
______________________________________________________________________________________________________________________________________________________
lambda_13 (Lambda)                                                 (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
re_lu_3 (ReLU)                                                     (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
lambda_14 (Lambda)                                                 (None, 56, 56, 64)                                          0                      
______________________________________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                                                  (None, 28, 28, 128)                                         73728                  
______________________________________________________________________________________________________________________________________________________
lambda_15 (Lambda)                                                 (None, 28, 28, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)                         (None, 28, 28, 128)                                         512                    
______________________________________________________________________________________________________________________________________________________
lambda_16 (Lambda)                                                 (None, 28, 28, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
re_lu_4 (ReLU)                                                     (None, 28, 28, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_17 (Lambda)                                                 (None, 28, 28, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                                                  (None, 14, 14, 128)                                         147456                 
______________________________________________________________________________________________________________________________________________________
lambda_18 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)                         (None, 14, 14, 128)                                         512                    
______________________________________________________________________________________________________________________________________________________
lambda_19 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
re_lu_5 (ReLU)                                                     (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_20 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                                                  (None, 14, 14, 128)                                         147456                 
______________________________________________________________________________________________________________________________________________________
lambda_21 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)                         (None, 14, 14, 128)                                         512                    
______________________________________________________________________________________________________________________________________________________
lambda_22 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
re_lu_6 (ReLU)                                                     (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_23 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                                                  (None, 14, 14, 128)                                         147456                 
______________________________________________________________________________________________________________________________________________________
lambda_24 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)                         (None, 14, 14, 128)                                         512                    
______________________________________________________________________________________________________________________________________________________
lambda_25 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
re_lu_7 (ReLU)                                                     (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_26 (Lambda)                                                 (None, 14, 14, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                                                  (None, 7, 7, 256)                                           294912                 
______________________________________________________________________________________________________________________________________________________
lambda_27 (Lambda)                                                 (None, 7, 7, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)                         (None, 7, 7, 256)                                           1024                   
______________________________________________________________________________________________________________________________________________________
lambda_28 (Lambda)                                                 (None, 7, 7, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
re_lu_8 (ReLU)                                                     (None, 7, 7, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_29 (Lambda)                                                 (None, 7, 7, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
conv2d_10 (Conv2D)                                                 (None, 4, 4, 256)                                           589824                 
______________________________________________________________________________________________________________________________________________________
lambda_30 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)                         (None, 4, 4, 256)                                           1024                   
______________________________________________________________________________________________________________________________________________________
lambda_31 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
re_lu_9 (ReLU)                                                     (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_32 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
conv2d_11 (Conv2D)                                                 (None, 4, 4, 256)                                           589824                 
______________________________________________________________________________________________________________________________________________________
lambda_33 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)                        (None, 4, 4, 256)                                           1024                   
______________________________________________________________________________________________________________________________________________________
lambda_34 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
re_lu_10 (ReLU)                                                    (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_35 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
conv2d_12 (Conv2D)                                                 (None, 4, 4, 256)                                           589824                 
______________________________________________________________________________________________________________________________________________________
lambda_36 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)                        (None, 4, 4, 256)                                           1024                   
______________________________________________________________________________________________________________________________________________________
lambda_37 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
re_lu_11 (ReLU)                                                    (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_38 (Lambda)                                                 (None, 4, 4, 256)                                           0                      
______________________________________________________________________________________________________________________________________________________
conv2d_13 (Conv2D)                                                 (None, 2, 2, 512)                                           1179648                
______________________________________________________________________________________________________________________________________________________
lambda_39 (Lambda)                                                 (None, 2, 2, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)                        (None, 2, 2, 512)                                           2048                   
______________________________________________________________________________________________________________________________________________________
lambda_40 (Lambda)                                                 (None, 2, 2, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
re_lu_12 (ReLU)                                                    (None, 2, 2, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_41 (Lambda)                                                 (None, 2, 2, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
conv2d_14 (Conv2D)                                                 (None, 1, 1, 512)                                           2359296                
______________________________________________________________________________________________________________________________________________________
lambda_42 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_13 (BatchNormalization)                        (None, 1, 1, 512)                                           2048                   
______________________________________________________________________________________________________________________________________________________
lambda_43 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
re_lu_13 (ReLU)                                                    (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_44 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
conv2d_15 (Conv2D)                                                 (None, 1, 1, 512)                                           2359296                
______________________________________________________________________________________________________________________________________________________
lambda_45 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_14 (BatchNormalization)                        (None, 1, 1, 512)                                           2048                   
______________________________________________________________________________________________________________________________________________________
lambda_46 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
re_lu_14 (ReLU)                                                    (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_47 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
conv2d_16 (Conv2D)                                                 (None, 1, 1, 512)                                           2359296                
______________________________________________________________________________________________________________________________________________________
lambda_48 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
batch_normalization_15 (BatchNormalization)                        (None, 1, 1, 512)                                           2048                   
______________________________________________________________________________________________________________________________________________________
lambda_49 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
re_lu_15 (ReLU)                                                    (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_50 (Lambda)                                                 (None, 1, 1, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
global_average_pooling2d (GlobalAveragePooling2D)                  (None, 512)                                                 0                      
______________________________________________________________________________________________________________________________________________________
lambda_51 (Lambda)                                                 (None, 512)                                                 0                      
______________________________________________________________________________________________________________________________________________________
dense (Dense)                                                      (None, 1000)                                                512000                 
______________________________________________________________________________________________________________________________________________________
lambda_52 (Lambda)                                                 (None, 1000)                                                0                      
======================================================================================================================================================
Total params: 11,514,560
Trainable params: 11,506,880
Non-trainable params: 7,680
______________________________________________________________________________________________________________________________________________________
None
