Model: "model"
______________________________________________________________________________________________________________________________________________________
Layer (type)                                                       Output Shape                                                Param #                
======================================================================================================================================================
input_1 (InputLayer)                                               [(None, 224, 224, 3)]                                       0                      
______________________________________________________________________________________________________________________________________________________
lambda (Lambda)                                                    (None, 224, 224, 3)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d (Conv2D)                                                    (None, 224, 224, 64)                                        1792                   
______________________________________________________________________________________________________________________________________________________
lambda_1 (Lambda)                                                  (None, 224, 224, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
conv2d_1 (Conv2D)                                                  (None, 224, 224, 64)                                        36928                  
______________________________________________________________________________________________________________________________________________________
lambda_2 (Lambda)                                                  (None, 224, 224, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                                       (None, 112, 112, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
lambda_3 (Lambda)                                                  (None, 112, 112, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
conv2d_2 (Conv2D)                                                  (None, 112, 112, 128)                                       73856                  
______________________________________________________________________________________________________________________________________________________
lambda_4 (Lambda)                                                  (None, 112, 112, 128)                                       0                      
______________________________________________________________________________________________________________________________________________________
conv2d_3 (Conv2D)                                                  (None, 112, 112, 128)                                       147584                 
______________________________________________________________________________________________________________________________________________________
lambda_5 (Lambda)                                                  (None, 112, 112, 128)                                       0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)                                     (None, 56, 56, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_6 (Lambda)                                                  (None, 56, 56, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_4 (Conv2D)                                                  (None, 56, 56, 256)                                         295168                 
______________________________________________________________________________________________________________________________________________________
lambda_7 (Lambda)                                                  (None, 56, 56, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_5 (Conv2D)                                                  (None, 56, 56, 256)                                         590080                 
______________________________________________________________________________________________________________________________________________________
lambda_8 (Lambda)                                                  (None, 56, 56, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_6 (Conv2D)                                                  (None, 56, 56, 256)                                         590080                 
______________________________________________________________________________________________________________________________________________________
lambda_9 (Lambda)                                                  (None, 56, 56, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)                                     (None, 28, 28, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_10 (Lambda)                                                 (None, 28, 28, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_7 (Conv2D)                                                  (None, 28, 28, 512)                                         1180160                
______________________________________________________________________________________________________________________________________________________
lambda_11 (Lambda)                                                 (None, 28, 28, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_8 (Conv2D)                                                  (None, 28, 28, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_12 (Lambda)                                                 (None, 28, 28, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_9 (Conv2D)                                                  (None, 28, 28, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_13 (Lambda)                                                 (None, 28, 28, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)                                     (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_14 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_10 (Conv2D)                                                 (None, 14, 14, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_15 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_11 (Conv2D)                                                 (None, 14, 14, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_16 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
conv2d_12 (Conv2D)                                                 (None, 14, 14, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_17 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)                                     (None, 7, 7, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_18 (Lambda)                                                 (None, 7, 7, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
flatten (Flatten)                                                  (None, 25088)                                               0                      
______________________________________________________________________________________________________________________________________________________
lambda_19 (Lambda)                                                 (None, 25088)                                               0                      
______________________________________________________________________________________________________________________________________________________
dense (Dense)                                                      (None, 4096)                                                102764544              
______________________________________________________________________________________________________________________________________________________
lambda_20 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
dropout (Dropout)                                                  (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
lambda_21 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
dense_1 (Dense)                                                    (None, 4096)                                                16781312               
______________________________________________________________________________________________________________________________________________________
lambda_22 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
dropout_1 (Dropout)                                                (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
lambda_23 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
dense_2 (Dense)                                                    (None, 2)                                                   8194                   
______________________________________________________________________________________________________________________________________________________
lambda_24 (Lambda)                                                 (None, 2)                                                   0                      
======================================================================================================================================================
Total params: 134,268,738
Trainable params: 134,268,738
Non-trainable params: 0
______________________________________________________________________________________________________________________________________________________
None
