Model: "vgg19"
______________________________________________________________________________________________________________________________________________________
Layer (type)                                                       Output Shape                                                Param #                
======================================================================================================================================================
input_1 (InputLayer)                                               [(None, 224, 224, 3)]                                       0                      
______________________________________________________________________________________________________________________________________________________
lambda (Lambda)                                                    (None, 224, 224, 3)                                         0                      
______________________________________________________________________________________________________________________________________________________
block1_conv1 (Conv2D)                                              (None, 224, 224, 64)                                        1792                   
______________________________________________________________________________________________________________________________________________________
lambda_1 (Lambda)                                                  (None, 224, 224, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
block1_conv2 (Conv2D)                                              (None, 224, 224, 64)                                        36928                  
______________________________________________________________________________________________________________________________________________________
lambda_2 (Lambda)                                                  (None, 224, 224, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
block1_pool (MaxPooling2D)                                         (None, 112, 112, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
lambda_3 (Lambda)                                                  (None, 112, 112, 64)                                        0                      
______________________________________________________________________________________________________________________________________________________
block2_conv1 (Conv2D)                                              (None, 112, 112, 128)                                       73856                  
______________________________________________________________________________________________________________________________________________________
lambda_4 (Lambda)                                                  (None, 112, 112, 128)                                       0                      
______________________________________________________________________________________________________________________________________________________
block2_conv2 (Conv2D)                                              (None, 112, 112, 128)                                       147584                 
______________________________________________________________________________________________________________________________________________________
lambda_5 (Lambda)                                                  (None, 112, 112, 128)                                       0                      
______________________________________________________________________________________________________________________________________________________
block2_pool (MaxPooling2D)                                         (None, 56, 56, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_6 (Lambda)                                                  (None, 56, 56, 128)                                         0                      
______________________________________________________________________________________________________________________________________________________
block3_conv1 (Conv2D)                                              (None, 56, 56, 256)                                         295168                 
______________________________________________________________________________________________________________________________________________________
lambda_7 (Lambda)                                                  (None, 56, 56, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
block3_conv2 (Conv2D)                                              (None, 56, 56, 256)                                         590080                 
______________________________________________________________________________________________________________________________________________________
lambda_8 (Lambda)                                                  (None, 56, 56, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
block3_conv3 (Conv2D)                                              (None, 56, 56, 256)                                         590080                 
______________________________________________________________________________________________________________________________________________________
lambda_9 (Lambda)                                                  (None, 56, 56, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
block3_conv4 (Conv2D)                                              (None, 56, 56, 256)                                         590080                 
______________________________________________________________________________________________________________________________________________________
lambda_10 (Lambda)                                                 (None, 56, 56, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
block3_pool (MaxPooling2D)                                         (None, 28, 28, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_11 (Lambda)                                                 (None, 28, 28, 256)                                         0                      
______________________________________________________________________________________________________________________________________________________
block4_conv1 (Conv2D)                                              (None, 28, 28, 512)                                         1180160                
______________________________________________________________________________________________________________________________________________________
lambda_12 (Lambda)                                                 (None, 28, 28, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block4_conv2 (Conv2D)                                              (None, 28, 28, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_13 (Lambda)                                                 (None, 28, 28, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block4_conv3 (Conv2D)                                              (None, 28, 28, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_14 (Lambda)                                                 (None, 28, 28, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block4_conv4 (Conv2D)                                              (None, 28, 28, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_15 (Lambda)                                                 (None, 28, 28, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block4_pool (MaxPooling2D)                                         (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
lambda_16 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block5_conv1 (Conv2D)                                              (None, 14, 14, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_17 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block5_conv2 (Conv2D)                                              (None, 14, 14, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_18 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block5_conv3 (Conv2D)                                              (None, 14, 14, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_19 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block5_conv4 (Conv2D)                                              (None, 14, 14, 512)                                         2359808                
______________________________________________________________________________________________________________________________________________________
lambda_20 (Lambda)                                                 (None, 14, 14, 512)                                         0                      
______________________________________________________________________________________________________________________________________________________
block5_pool (MaxPooling2D)                                         (None, 7, 7, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
lambda_21 (Lambda)                                                 (None, 7, 7, 512)                                           0                      
______________________________________________________________________________________________________________________________________________________
flatten (Flatten)                                                  (None, 25088)                                               0                      
______________________________________________________________________________________________________________________________________________________
lambda_22 (Lambda)                                                 (None, 25088)                                               0                      
______________________________________________________________________________________________________________________________________________________
fc1 (Dense)                                                        (None, 4096)                                                102764544              
______________________________________________________________________________________________________________________________________________________
lambda_23 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
fc2 (Dense)                                                        (None, 4096)                                                16781312               
______________________________________________________________________________________________________________________________________________________
lambda_24 (Lambda)                                                 (None, 4096)                                                0                      
______________________________________________________________________________________________________________________________________________________
predictions (Dense)                                                (None, 1000)                                                4097000                
======================================================================================================================================================
Total params: 143,667,240
Trainable params: 143,667,240
Non-trainable params: 0
______________________________________________________________________________________________________________________________________________________
None
